Revit 2026 API

# SlabShapeEditorIsEnabled Property

---

Identifies if the slab shape editing functionality is enabled.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsEnabled { get; }
```
```vb
Public ReadOnly Property IsEnabled As Boolean
	Get
```
```cpp
public:
property bool IsEnabled {
	bool get ();
}
```
```fsharp
member IsEnabled : bool with get
```

#### Property Value

Boolean

If true, the creases and vertices are accessible and modifiable. If false, no creases and vertices are accessible.

#### Reference

SlabShapeEditor Class

Autodesk.Revit.DB Namespace